package fiofix

import "strings"

var russianReplacer = strings.NewReplacer(
	// Очистка
	"XXX", "", "xxx", "", "ХХХ", "", "ххх", "",

	// Многосимвольные сочетания
	"SCH", "Щ", "Sch", "Щ", "sch", "щ",
	"SH", "Ш", "Sh", "Ш", "sh", "ш",
	"CH", "Ч", "Ch", "Ч", "ch", "ч",
	"TS", "Ц", "Ts", "Ц", "ts", "ц",
	"ZH", "Ж", "Zh", "Ж", "zh", "ж",
	"KH", "Х", "Kh", "Х", "kh", "х",
	"YA", "Я", "Ya", "Я", "ya", "я",
	"JA", "Я", "Ja", "Я", "ja", "я",
	"YU", "Ю", "Yu", "Ю", "yu", "ю",
	"JU", "Ю", "Ju", "Ю", "ju", "ю",
	"YO", "Ё", "Yo", "Ё", "yo", "ё",
	"JO", "ЖО", "Jo", "Жо", "jo", "жо",
	"YE", "Е", "Ye", "Е", "ye", "е",
	"JE", "Э", "Je", "Э", "je", "э",
	"IA", "Я", "Ia", "Я", "ia", "я",
	"IU", "Ю", "Iu", "Ю", "iu", "ю",

	"OU", "У", "ou", "у",
	"CO", "КО", "co", "ко",
	"CK", "КК", "ck", "кк",

	"X", "КС", "x", "кс",

	// Казахские и другие буквы
	"Қ", "К", "қ", "к",
	"Ә", "Э", "ә", "э",
	"Ұ", "У", "ұ", "у",
	"Ғ", "Г", "ғ", "г",
	"І", "И", "і", "и",
	"Ң", "Н", "ң", "н",
	"Ө", "О", "ө", "о",
	"Ү", "У", "ү", "у",
	"Ў", "У", "ў", "у",
	"Ѓ", "Г", "ѓ", "г",
	"Ќ", "К", "ќ", "к",
	"Ћ", "Х", "ћ", "х",
	"Һ", "Х", "һ", "х",

	// Латинские буквы
	"A", "А", "a", "а",
	"B", "Б", "b", "б",
	"V", "В", "v", "в",
	"G", "Г", "g", "г",
	"D", "Д", "d", "д",
	"E", "Е", "e", "е",
	"Z", "З", "z", "з",
	"I", "И", "i", "и",
	"J", "Й", "j", "й",
	"K", "К", "k", "к",
	"L", "Л", "l", "л",
	"M", "М", "m", "м",
	"N", "Н", "n", "н",
	"O", "О", "o", "о",
	"P", "П", "p", "п",
	"R", "Р", "r", "р",
	"S", "С", "s", "с",
	"T", "Т", "t", "т",
	"U", "У", "u", "у",
	"F", "Ф", "f", "ф",
	"H", "Х", "h", "х",
	"C", "Ц", "c", "ц",
	"Y", "Ы", "y", "ы",

	// Ъ и Ь (мягкий и твёрдый знак)
	"'", "ь",
	"''", "ъ",
)

// Заменяет символы на русские
func ReplaceLettersToRussian(s string) string {
	return russianReplacer.Replace(s)
}
